homer1013/BasaltOS/boards/esp32/m5stickc_plus2/sdkconfig.defaults
# M5StickC Plus2 (ESP32-PICO-V3-02) baseline defaults
CONFIG_IDF_TARGET="esp32"

# Console
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_NUM=0
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# Flash size (M5StickC Plus2: 8MB)
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# PSRAM (M5StickC Plus2: 2MB PSRAM)
CONFIG_ESP32_SPIRAM_SUPPORT=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_BOOT_INIT=y

# --- Debug WDT / livelock resets ---
CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y
CONFIG_ESP_SYSTEM_PANIC_REBOOT_DELAY_SECONDS=2

# Task watchdog: PANIC (prints offender + backtrace)
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=20

# (optional) if you want max verbosity while debugging
CONFIG_LOG_DEFAULT_LEVEL_DEBUG=y

# --- Interrupt watchdog diagnostics ---
CONFIG_ESP_INT_WDT=y
CONFIG_ESP_INT_WDT_TIMEOUT_MS=800
CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y
CONFIG_ESP_SYSTEM_PANIC_REBOOT_DELAY_SECONDS=2
CONFIG_ESP_SYSTEM_PANIC_SILENT_REBOOT=n
CONFIG_ESP_SYSTEM_PANIC_GDBSTUB=n

# Print early logs (helps if crash is very early)
CONFIG_BOOTLOADER_LOG_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL_DEBUG=y
